app/controllers/articles_controller.rb

  def index
    viewing_user = User.find session[:user_id]
    if viewing_user.username == ENV["ENNOVAR_HPC_ACCOUNT_USERNAME"]
      @user_articles = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)
    @article.user_id = session[:user_id]

    created_by = User.find_by_id(session[:user_id])
    @article.creator_username = created_by.username

    #@article.creator_username = Article.all.map {|article| article.user}

    @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Title1"], ["text", "Text1"], ["created_at", "2016-08-01 03:32:38.911936"], ["updated_at", "2016-08-01 03:32:38.911936"]]